Revit 2027 API
MechanicalEquipmentSet.OnStandby Property
 The number of pieces of mechanical equipment that are not operational at any given time.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int OnStandby { get; set; }
Public Property OnStandby As Integer
	Get
	Set
public:
property int OnStandby {
	int get ();
	void set (int value);
}
member OnStandby : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: There should be at least one equipment on duty.
See Also
Reference
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace